---
kind: type
id: T:Autodesk.Revit.DB.TransactWithCentralOptions
source: html/f5da22fa-55ee-9196-cafd-5323d8e9ca0a.htm
---
# Autodesk.Revit.DB.TransactWithCentralOptions

Options to customize Revit behavior when accessing the central model.

## Syntax (C#)
```csharp
public class TransactWithCentralOptions : IDisposable
```